<template>
    <div>
        <el-row :gutter="20">
            <el-col :span="24"><h3>Бағдарламашы (Программист) мамандығы туралы</h3></el-col>
            <el-col :span="10">
                <div class="img">
                    <img src="../assets/progger.jpg"/>
                </div>
            </el-col>
            <el-col :span="14">
                <div class="text-wrapper">
                    Бағдарламашыларды салаларға байланысты үшке бөліп қарауға болады. Қолданбалы бағдарламашылар көбіне ойындар, есептеу бағдарламалары, редакторлар мен мессенджерлерді қамтамасыз ететін бағдарламаларды жабдықтаумен айналысады. Олардың саласындағы жұмыстарға тағы да жүйелі видео және аудио бақылаулар орнату, от өшіру жүйелері мен сигнал беру жабдықтарын жатқызуға болады.
                    </div>
            </el-col>
            <el-col :span="24">
                <div class="text-wrapper">
                    <span style="font-weight: bold">Бағдарламашы – арнайы математикалық модельдеудің көмегімен компьютерлік бағдарламаларды және алгоритмдерді құрастыратын маман.</span>
                    Жүйелік бағдарламашылар операциялық жүйелерді, желі платформаларын, интерфейс жабдықтарын, әр түрлі ақпарат орталықтарын жинақтайтын ғаламтор беттерін жасаумен айналысады. Бұл саланың маманын жоғары төлемақыға ие бола алатындар қатарына жатқызамыз. Сонымен қатар, олар бағдарламалық қамту жүйелерін (сервис), есептеуді қаматамасыз ететін блоктарды (процессор, коммуникациялық және перефириялық құрылғылар) да жасайды. Web-бағдарламашылар да желімен жұмыс жасайды. Дегенмен, олардың негізгі міндетіне ғаламтормен жұмыс істеу кіреді. Олар сайттардың бағдарламалармен қамтылуын, динамикалық веб-беттерді және дерекқормен жұмыс жасайтын web-интерфейстерді жасаумен айналысады.
                    <br><br>Бағдарламашы ғылыми-техникалық және өндірістік есептерді математикалық модельдерді талдау мен алгоритмдік шешімдер арқылы есептеу жұмыстарын атқаратын бағдарламаларды құрастырады. Сондай-ақ, олар автоматты, типтік және стандартты бағдарламаларды және сыртқы алгоритмдік тілдерді жасақтаумен жұмыс істейді.
                    <br><br>Бағдарламашы өте жылдам дамып жатқан технологияларға бейімделе білуі қажет. Сол себептен, өзін-өзі оқыту ең басты касиеттерінің бірі болуы тиіс. Әйтпесе, бірнеше жылдың көлемінде маманның маңызы кетіп, жұмыстан шығып кетуі мүмкін. Техникалық құжаттарды оқи алатын дәрежеде ағылшын тілін білу де ең маңызды талаптардың бірі. Аталған маман иелері топпен жұмыс істей алуы керек. Үлкен жобаларда біріге, жұмыла жұмыс жасай алатын мінездің болғаны да артықтық етпейді.
                </div>
            </el-col>
        </el-row>
    </div>
</template>

<script>
  export default {
    name: "PopularProfessions",
  }
</script>

<style scoped>
    .text-wrapper {
        text-align: justify;
        font-size: 14px;
    }
    img{
        width: 100%;
        margin-bottom: 5px;
    }
</style>